BO/lib/itaPHPPaleo4/test/reqProtocolloPartenza.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://paleo.regione.marche.it/services/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:ProtocollazionePartenza>
         <!--Optional:-->
         <ser:richiesta>
            <!--Optional:-->
            <ser:Classificazioni>
               <!--Zero or more repetitions:-->
               <ser:Classificazione>
                  <!--Optional:-->
                  <!--type: string-->
                  <ser:CodiceFascicolo>gero et</ser:CodiceFascicolo>
                  <!--Optional:-->
                  <ser:NuovoFascicolo>
                     <!--Optional:-->
                     <!--type: int-->
                     <ser:AnniConservazione>3</ser:AnniConservazione>
                     <!--type: string-->
                     <ser:CodiceClassifica>sonoras imperio</ser:CodiceClassifica>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:CodiceFaldone>quae divum incedo</ser:CodiceFaldone>
                     <ser:Custode>
                        <!--type: string-->
                        <ser:CodiceUO>verrantque per auras</ser:CodiceUO>
                        <!--type: string-->
                        <ser:Cognome>per auras</ser:Cognome>
                        <!--Optional:-->
                        <!--type: string-->
                        <ser:Nome>circum claustra</ser:Nome>
                        <!--type: string-->
                        <ser:Ruolo>nimborum in</ser:Ruolo>
                     </ser:Custode>
                     <!--type: string-->
                     <ser:Descrizione>foedere certo</ser:Descrizione>
                     <!--Optional:-->
                     <!--type: int-->
                     <ser:IdSerieArchivistica>3</ser:IdSerieArchivistica>
                     <!--Optional:-->
                     <!--type: int-->
                     <ser:IdTipoDati>3</ser:IdTipoDati>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:Note>profundum quippe ferant</ser:Note>
                  </ser:NuovoFascicolo>
               </ser:Classificazione>
            </ser:Classificazioni>
            <!--Optional:-->
            <ser:DocumentiAllegati>
               <!--Zero or more repetitions:-->
               <ser:Allegato>
                  <!--type: string-->
                  <ser:Descrizione>et carcere</ser:Descrizione>
                  <!--Optional:-->
                  <ser:Documento>
                     <!--type: string-->
                     <ser:Nome>iovis rapidum iaculata</ser:Nome>
                     <!--type: base64Binary-->
                     <ser:Stream>cid:1266013679054</ser:Stream>
                  </ser:Documento>
                  <!--Optional:-->
                  <!--type: int-->
                  <ser:NumeroPagine>3</ser:NumeroPagine>
               </ser:Allegato>
            </ser:DocumentiAllegati>
            <!--Optional:-->
            <ser:DocumentoPrincipale>
               <!--type: string-->
               <ser:Nome>speluncis abdidit</ser:Nome>
               <!--type: base64Binary-->
               <ser:Stream>cid:1219855268395</ser:Stream>
            </ser:DocumentoPrincipale>
            <!--type: boolean-->
            <ser:DocumentoPrincipaleAcquisitoIntegralmente>true</ser:DocumentoPrincipaleAcquisitoIntegralmente>
            <!--Optional:-->
            <!--type: TipoOriginale - enumeration: [NonDefinito,Digitale,Cartaceo]-->
            <ser:DocumentoPrincipaleOriginale>Cartaceo</ser:DocumentoPrincipaleOriginale>
            <!--Optional:-->
            <!--type: string-->
            <ser:Note>flammas turbine</ser:Note>
            <!--type: string-->
            <ser:Oggetto>hoc metuens</ser:Oggetto>
            <ser:Operatore>
               <!--type: string-->
               <ser:CodiceUO>ac vinclis</ser:CodiceUO>
               <!--type: string-->
               <ser:Cognome>speluncis abdidit</ser:Cognome>
               <!--Optional:-->
               <!--type: string-->
               <ser:Nome>aris imponet honorem</ser:Nome>
               <!--type: string-->
               <ser:Ruolo>praeterea aut</ser:Ruolo>
            </ser:Operatore>
            <!--type: boolean-->
            <ser:Privato>true</ser:Privato>
            <!--Optional:-->
            <ser:Trasmissione>
               <!--Optional:-->
               <!--type: boolean-->
               <ser:InvioOriginaleCartaceo>false</ser:InvioOriginaleCartaceo>
               <!--Optional:-->
               <!--type: string-->
               <ser:NoteGenerali>imperio premit</ser:NoteGenerali>
               <!--type: boolean-->
               <ser:SegueCartaceo>false</ser:SegueCartaceo>
               <!--Optional:-->
               <ser:TrasmissioniRuolo>
                  <!--Zero or more repetitions:-->
                  <ser:TrasmissioneRuolo>
                     <!--type: string-->
                     <ser:CodiceUODestinataria>et montis</ser:CodiceUODestinataria>
                     <!--Optional:-->
                     <!--type: dateTime-->
                     <ser:DataScadenza>2000-01-06T22:03:12</ser:DataScadenza>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:Note>pectore flammas</ser:Note>
                     <!--type: string-->
                     <ser:Ragione>pectore flammas</ser:Ragione>
                     <!--type: string-->
                     <ser:RuoloDestinatario>annos bella gero</ser:RuoloDestinatario>
                  </ser:TrasmissioneRuolo>
               </ser:TrasmissioniRuolo>
               <!--Optional:-->
               <ser:TrasmissioniUtente>
                  <!--Zero or more repetitions:-->
                  <ser:TrasmissioneUtente>
                     <!--Optional:-->
                     <!--type: dateTime-->
                     <ser:DataScadenza>2005-01-22T00:35:36+01:00</ser:DataScadenza>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:Note>bella gero</ser:Note>
                     <ser:OperatoreDestinatario>
                        <!--type: string-->
                        <ser:CodiceUO>dedit qui foedere</ser:CodiceUO>
                        <!--type: string-->
                        <ser:Cognome>magno cum</ser:Cognome>
                        <!--Optional:-->
                        <!--type: string-->
                        <ser:Nome>ac terras</ser:Nome>
                        <!--type: string-->
                        <ser:Ruolo>regemque dedit</ser:Ruolo>
                     </ser:OperatoreDestinatario>
                     <!--type: string-->
                     <ser:Ragione>infixit acuto</ser:Ragione>
                  </ser:TrasmissioneUtente>
               </ser:TrasmissioniUtente>
            </ser:Trasmissione>
            <!--type: string-->
            <ser:CodiceRegistro>tenens mollitque animos</ser:CodiceRegistro>
            <!--Optional:-->
            <ser:Emergenza>
               <!--type: dateTime-->
               <ser:Data>2015-08-04T02:55:16</ser:Data>
               <!--type: int-->
               <ser:Numero>3</ser:Numero>
               <!--type: string-->
               <ser:Segnatura>insuper altos</ser:Segnatura>
            </ser:Emergenza>
            <ser:Destinatari>
               <!--Zero or more repetitions:-->
               <ser:Corrispondente>
                  <!--Optional:-->
                  <!--type: string-->
                  <ser:CodiceRubrica>cum murmure</ser:CodiceRubrica>
                  <!--Optional:-->
                  <ser:CorrispondenteOccasionale>
                     <!--Optional:-->
                     <ser:MessaggioRisultato>
                        <!--Optional:-->
                        <!--type: string-->
                        <ser:Descrizione>in patriam</ser:Descrizione>
                        <!--Optional:-->
                        <!--type: TipoRisultato - enumeration: [Info,Warning,Error]-->
                        <ser:TipoRisultato>Error</ser:TipoRisultato>
                     </ser:MessaggioRisultato>
                     <!--type: string-->
                     <ser:Cognome>iunonis adorat</ser:Cognome>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:Email>adorat praeterea</ser:Email>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:IdFiscale>illum exspirantem transfixo</ser:IdFiscale>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:IstatComune>aris imponet honorem</ser:IstatComune>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:Nome>aris imponet</ser:Nome>
                     <!--Optional:-->
                     <!--type: TipoVoceRubrica - enumeration: [Indefinito,Amministrazione,AOO,UO,Persona,Altro,Impresa]-->
                     <ser:Tipo>Persona</ser:Tipo>
                  </ser:CorrispondenteOccasionale>
               </ser:Corrispondente>
            </ser:Destinatari>
            <!--Optional:-->
            <ser:DestinatariCC>
               <!--Zero or more repetitions:-->
               <ser:Corrispondente>
                  <!--Optional:-->
                  <!--type: string-->
                  <ser:CodiceRubrica>montis insuper altos</ser:CodiceRubrica>
                  <!--Optional:-->
                  <ser:CorrispondenteOccasionale>
                     <!--Optional:-->
                     <ser:MessaggioRisultato>
                        <!--Optional:-->
                        <!--type: string-->
                        <ser:Descrizione>molemque et montis</ser:Descrizione>
                        <!--Optional:-->
                        <!--type: TipoRisultato - enumeration: [Info,Warning,Error]-->
                        <ser:TipoRisultato>Warning</ser:TipoRisultato>
                     </ser:MessaggioRisultato>
                     <!--type: string-->
                     <ser:Cognome>nimborum in</ser:Cognome>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:Email>vasto rex</ser:Email>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:IdFiscale>flammato secum</ser:IdFiscale>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:IstatComune>tempestatesque sonoras</ser:IstatComune>
                     <!--Optional:-->
                     <!--type: string-->
                     <ser:Nome>tenens mollitque</ser:Nome>
                     <!--Optional:-->
                     <!--type: TipoVoceRubrica - enumeration: [Indefinito,Amministrazione,AOO,UO,Persona,Altro,Impresa]-->
                     <ser:Tipo>Amministrazione</ser:Tipo>
                  </ser:CorrispondenteOccasionale>
               </ser:Corrispondente>
            </ser:DestinatariCC>
         </ser:richiesta>
      </ser:ProtocollazionePartenza>
   </soapenv:Body>
</soapenv:Envelope>